{
  "races": [
    {
      "name": "Human",
      "type": "Humanoid",
      "description": "Common, but far from mundane, as a human you are part of a vibrant and widespread group who control the vast majority of the civilised world. With civilisation comes opportunity, variety,and potential.",
      "appearance": "Humans in Coryphiel look just like humans in the real world, with just as much variety.",
      "benefits": [
        {
          "title": "Diverse Skill-set:",
          "description": "You gain one Background of your choice for free."
        }
      ],
      "optionalAbilities": [
        {
          "title": "Improvise",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Free Action",
          "description": "Once per round, immediately after making a Skill Check, Attack roll, or Casting roll, you may activate this ability to choose one of your other Traits or Expertises, which is not already applied but could be relevant to the roll, adding an additional instance of your Skill Bonus to the result"
        }
      ]
    },
    {
      "name": "Cambion",
      "type": "Dark Humanoid",
      "description": "Cambions, also known as Demon-Kin, are humans, who are affected by the Dark side of the Divine, and as such have taken on demonic traits. Cambions can be formed from having a demonic or cambion parent, being corrupted from proximity to Dark power, or being intentionally transformed by a ritual or Dark entity.",
      "appearance": "Cambions are mostly human in form, but have a few traits that mark them as being distinctly different. The most common cambion traits are sharp claws, red eyes, and horns on the head. Some may have an inhuman skin colour, a long tail, or sharp fang ",
      "characteristics": "Cambions are innately tainted by Darkness. This doesnt make them evil, but it does mean they are often more short-tempered, indulgent, and erratic, and usually apathetic towards laws and authority figures. If they allow this part of them to take hold, they can develop into becoming bloodthirsty, hedonistic, and chaotic. Cambions who continue on this path, and allow darkness to consume them, may become fully demonic, and lose control of their minds.",
      "benefits": [
        {
          "title": "Creature of the Night:",
          "description": "You can move up to 6 spaces when Sneaking."
        },
        { "title": "Feral Instincts:", "description": "+2 Reacting" },
        {
          "title": "Teeth & Claws:",
          "description": "You become Skilled in Unarmed, and your standard Unarmed Attacks deal 1d6 Blunt / Sharp damage"
        },
        {
          "title": "Dark Affinity:",
          "description": "Gain Resistance to Shadow damage, and Vulnerability to Radiant damage. You are unable to use Light magic."
        },
        {
          "title": "Dark Sight:",
          "description": "You are able to see without penalty in Dim light. In Darkness you can sense things clearly within a Close (3) range, and do not suffer penalties within that range."
        }
      ],
      "optionalAbilities": [
        {
          "title": "Shadow Step",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Action or Reaction.",
          "description": "When standing in an area of Dim Light or Darkness, you can teleport to another area of Dim Light or Darkness you can see within a Short Range (6 spaces). You cannot use Shadow Step while you are Restrained. If you use Shadow Step to dodge an attack, you may roll for casting instead of 45 Steel and Scale Games Ltd doing a response roll. If you fail this roll, you spend the Energy, but do not successfully teleport away."
        },
        {
          "title": "Frenzied Strike",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Free Action",
          "description": "Once per turn, after you damage an entity with a melee attack, you may activate this ability to make an Unarmed Attack against the same target, dealing +d6 Shadow damage. You gain 1 point of Panic whenever you use this ability."
        },
        {
          "title": "Subterfuge:",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Action",
          "duration": "Scene (Focus)",
          "description": "Subtly shift your appearance to seem more like a regular human. For the duration, most creatures would be unable to tell that you are a Cambion, unless they succeed a Perception-based Skill Check against your Resolve or Awareness (Whichevers highest). Can also cover up modifications and augments. Advance on Deception checks while active. Bright light dispels this ability"
        }
      ]
    },
    {
      "name": "Clockwork",
      "type": "Humanoid Machine",
      "description": "The process of creating a clockwork golem is expensive and complicated, but the result is marvellous. Clockworks are sometimes created by independent scientists, but more commonly created by institutions or companies, to fulfil a specific purpose, such as to act as servants or soldiers. Clockworks are a fairly recent creation, meaning that all clockworks are somewhat young, despite usually being created with an adult level of intelligence. ",
      "appearance": "Clockworks vary in appearance due to their artificial nature, however they usually share some common traits. Clockworks are all mostly humanoid in shape, and are crafted from brass, steel, and ceramics. Beyond this, they vary from simple to ornate; some may be spindly and delicate, others clunky machines with mis-matching parts.",
      "characteristics": "A Clockworks robotic speech and movement often belies the complicated and intelligent mind within. Though it may not always be evident, Clockworks are capable of a wide range of emotions, just like any human, and have the potential to be just as empathetic and sentimental.",
      "benefits": [
        {
          "title": "Steel Chassis:",
          "description": "Gain Innate Armour, with Physical Protection 3."
        },
        {
          "title": "Resistances and Immunities:",
          "description": "Immunity to Blight Damage and Immunity to Bleed Damage."
        },
        {
          "title": "Logical Processes:",
          "description": "+2 Resolve."
        },
        {
          "title": "Mechanical Form:",
          "description": "Clockworks are constructed of metal and ceramics, as opposed to flesh and blood. As such, they are completely immune to the effects of Poisons, Disease, Bleeding and anything which deals Blight damage. Clockworks sink underwater. Being underwater will affect a clockworks internal mechanisms, so they cannot spend too long immersed; use the same set of rules for humans holding their breath underwater and suffocating. "
        },
        {
          "title": "Wind-up:",
          "description": "Clockworks dont need to eat or sleep, but in order to benefit from a rest they must be wound-up by another entity during that rest."
        },
        {
          "title": "No Natural Healing:",
          "description": "Clockworks do not recover HP or Wounds from any Healing Items, Healing Magic, Medicine, or Resting. Repair Kits must be used to heal a Clockwork, and function the same as Healing Kits do for a human. Injuries will likewise not restore naturally, but can be fixed over a Long Rest by a character with the Mechanics Expertise, using a Repair Kit."
        }
      ],
      "optionalAbilities": [
        {
          "title": "Analogue Databanks",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Action",
          "duration": "Scene",
          "description": "When you gain this ability choose three Expertises which you do not already have. Note these down as being stored in your databanks. When you activate this ability, you can choose one of those stored Expertises to gain for the duration. "
        },
        {
          "title": "Overclock",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Free Action",
          "description": "When you activate this ability, you gain an additional Action and Movement this turn, and an extra Reaction this round. However, at the start of your next turn you suffer 2 points of Exhaustion. You cannot activate Overclock multiple turns in a row"
        },
        {
          "title": "Recycled Parts",
          "cpCost": 2,
          "requirements": "Expertise in Mechanics",
          "energyCost": 1,
          "actionCost": "Action",
          "description": "Spend a Repairkit, some Scrap Metal, a Clockwork part, or a piece of machinery to haphazardly repair yourself. Choose one of the following options: Regain 2d6 (+ Skill Bonus) HP, Fix 1 Wound, Fix your innate armour (if its been Rended)"
        }
      ]
    },
    {
      "name": "Denizen",
      "type": "Humanoid Arcana",
      "description": "A Denizens body may mimic the form of one made from flesh and blood, but in fact they are created from pure arcane energy. This gives them a number of benefits, such as resistance to physical harm, but more importantly it prevents their body from ageing. However, the constitution of their physical form is inextricably linked to their mental fortitude, which is one of the reasons they focus on law and organisation so fiercely. A Denizen has about 200 years before they start to lose their grip on reality, both literally and figuratively. ",
      "appearance": "Outside of the Otherworld, Denizens like to be heavily covered up in robes and veils. This means that even the few humans who have met Denizens would likely have only seen the glowing eyes that peek out under their hoods and masks. Under their robes, Denizens have dark blue skin. Their blood glows, usually blue, and so do their eyes and the interior of their mouths. They do not have noses, and their hands have only two fingers and a thumb on each. Denizens can have anywhere between one and five eyes. ",
      "characteristics": "Since conquering the Otherworld, the Denizens have built an efficient, stratified society, with a regimented caste system and a strict code of laws. This is necessary to keep their unstable world from falling apart, all Denizens must do their part, and lawbreakers are swiftly punished. Denizens have a reputation for being highly litigious and bureaucratic, always following the rules to the letter. Though their society does encourage this culture, this is hardly representative of all Denizens; they have as much range of personalities as humans do. However there are Six Laws in particular which most Denizens treat as sacred. These laws mostly revolve around protecting the Otherworld, and keeping the structure of their society intact. Anybody who breaks one of these laws is cast out of their society and branded as a “Maletha”, a rogue Denizen.",
      "benefits": [
        {
          "title": "Mental Aptitude:",
          "description": "+2 Concentrating"
        },
        {
          "title": "Magical Form:",
          "description": "Resistant to Blight and Bleed damage, Immune to Disease"
        },
        {
          "title": "Denizen Education:",
          "description": "Gain Expertise in Bureaucracy or Magic Sciences"
        },
        {
          "title": "Magically Gifted:",
          "description": "Gain one Minor Spell from Arcane Magic."
        },
        {
          "title": "Unstable Form:",
          "description": "Panic inflicts its penalty to all a Denizens Skill Checks. When a Denizen suffers an Injury, instead of the usual results, it begins “Disintegrating”: Maximum HP and Energy are halved until a Long Rest is taken."
        }
      ],
      "optionalAbilities": [
        {
          "title": "Levitate",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Free Action",
          "duration": "Scene (Focus)",
          "description": "While active, you have the ability to Levitate when you move. You can move vertically or horizontally while levitating, but return to a distance of 2 or less spaces above the ground at the end of each of your turns. "
        },
        {
          "title": "Realm-phase",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Free Action",
          "duration": "3 Rounds",
          "description": "For the duration you gain +2 Evasion, Resistance to Physical damage, and become Intangible (See creature rules for details). "
        },
        {
          "title": "Binding Contract",
          "cpCost": 2,
          "actionCost": "2 Actions",
          "requirements": "Expertise in Bureaucracy",
          "description": "This ability allows you to sign a magical binding contract with one willing entity of your choice within Close (3) range. When creating the contract you can choose any number of the below features to be included. Contract Optional Features Summoning - Allow the bound entity to summon you to its side, from any distance, as an Action at the cost of 3 Energy. Sight - Allows you to see through the eyes of the Bound entity, and hear through their ears. This is an Action to activate. While doing this you will have a Setback on perception-based checks using your own senses, and your Awareness is halved. Telepathy - Allows both signatories involved in the contract to send a telepathic message to the other, regardless of distance, as a Free Action. Each sentence costs 1 Energy. Shared Power - You can spend the Bound entitys Energy as if it was your own, and vice versa. Obedience - Specify an action or behaviour that you or the bound entity are magically compelled to follow (e.g. “the Denizen must protect the bound entity from harm”). Terms and Conditions Both entities (“signatories”) must be willing to enter the contract. However, an entity does not have to read the contract in its entirety in order to sign it. An inattentive entity may sign up for something which doesnt benefit them. You may add conditions which will cause the contract to be broken (e.g. if the bound entity attacks you), and you can specify an amount of time that the contract will last. Contracts last forever unless otherwise specified, but you can only have one contract active at a time. You can end the contract, if both signatories are willing to do so, as an Action at any point."
        }
      ]
    },
    {
      "name": "Deva",
      "type": "Light Humanoid",
      "description": "Deva are one of the rarest strains of humans, far rarer than their dark counterpart Cambions. Rather than being an accident of divine magic, Deva are supposedly blessed by the gods",
      "appearance": "All Deva have at least one physical feature that makes them stand out; such as a golden halo upon their heads, vestigial wings, or white feathers along their arms. They also usually have glowing eyes and golden blood.",
      "characteristics": "Deva are designed to serve the will of the light. They retain their free will, however the influence of the light is often reflected in their personality. Devas will usually be ambitious and optimistic, often stubbornly committed to their goals and ideals, to varying degrees of extremity. Many are incredibly selfless, to the detriment of their own well-being. Others may be violently zealous, and commit horrible actions in the name of their aspirations. Not all Deva are entirely loyal to the Light, though in their position it can be difficult to turn away. Those Deva who do turn from the will of the Light are often subtly punished for doing so. They may find the benefits of their divine form diminish, or become unreliable. Some may suffer worse fates.",
      "benefits": [
        {
          "title": "Blessed Power:",
          "description": "+1 Energy"
        },
        {
          "title": "Searing Touch:",
          "description": "You gain an Unarmed Attack which deals 1d6 Radiant damage."
        },
        {
          "title": "Righteous:",
          "description": "You have Enmity against Dark entities and Undead."
        },
        {
          "title": "Light Affinity:",
          "description": "Gain Resistance to Radiant damage, and Vulnerability to Shadow damage. You are unable to use Dark magic."
        },
        {
          "title": "Divine Glow:",
          "description": "As a Free Action you can cause parts of your body to glow, emitting Bright light in a 3 space radius. If you are in Darkness, this is reduced to standard light. This does not count as a light source for the sake of using any Light magic you may have."
        }
      ],
      "optionalAbilities": [
        {
          "title": "Angelic Flight:",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Action",
          "duration": "3 Rounds",
          "description": "For the duration of this ability, golden angelic wings sprout from your back and you are able to Fly. While flying, your Dash distance is equal to your full movement distance. You have a Setback on ranged attacks you make while Flying."
        },
        {
          "title": "Burning Radiance:",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Action",
          "duration": "6 Rounds",
          "description": "Summon searing radiant flames from within your body. For the duration, any entity that hits you with a Melee attack, any entity you hit with a Melee Attack, or any entity involved in a grapple with you, is afflicted with 1d6 Radiant Withering for 3 rounds. At the start of each of your turns while this is active, you lose 2 HP. You can end the ability at any time."
        },
        {
          "title": "Wing Wall",
          "cpCost": 2,
          "energyCost": 1,
          "actionCost": "Action or Reaction.",
          "duration": "1 Round",
          "description": "You may Defend against Attacks and Explosions. Provides a Cover value equal to 9 plus your base Concentrating or Defending modifier, to yourself and any friendly entities within 1 space. Friendly entities within 1 space of you for the duration also gain Resistance to Radiant damage."
        }
      ]
    },
    {
      "name": "Dragonkin",
      "type": "Draconoid Humanoid",
      "description": "Dragonkin are descendents of particular humans who have been blessed by powerful dragons or, in rarer cases, are directly descended from a dragon themselves. They proudly bear draconic features, though over generations the bloodline is diluted and these features become less prominent. Nevertheless Dragonkin families often have prestigious positions in dragon-worshipping societies",
      "appearance": "Dragonkin are as varied as dragons themselves. They often have scaling on their brow or jaw, most have slit pupils, and some may even have large draconic horns upon their head or a long reptilian tail. The most common features for dragonkin are scaled hands and feet, which end in sharp clawsDragonkin appearance is largely determined by the nature of the dragon whose blood they share. A Dragonkin with Earth Dragon heritage will usually have thicker scales, in colours of brown or grey, while one related to a Water Dragon will be more streamlined, with fins, and blue scales.",
      "characteristics": "All Dragonkin are connected to an element, just like dragons are, and as such they often have a natural affinity for that element. If a Dragonkin learns magic, they are intuitively drawn to the element of their heritage. Their personalities often correlate with the element too; Fire Dragonkin often being naturally passionate, and quick to anger, Earth Dragonkin being stoic and stubborn, and so on, though this is not always the case",
      "benefits": [
        { "title": "Dragon Blood:", "description": "+4 HP." },
        {
          "title": "Claws & Teeth:",
          "description": "You become Skilled in Unarmed, and your standard Unarmed Attacks deal 1d6 Blunt / Sharp damage."
        }
      ],
      "racialOptions": {
        "title": ""
      },
      "optionalAbilities": [
        {
          "title": "",
          "cpCost": 0,
          "actionCost": "",
          "description": ""
        }
      ]
    }
  ]
}
